{
    "default": {
        "name": "Default",
        "description": "Default",
        "roles": [
            {
                "title": "Default",
                "dates": "Default",
                "descriptions": []
            }
        ]
    },
    "roll20": {
        "name": "Roll20",
        "description": "An online platform and companion mobile app for tabletop game management.",
        "roles": [
            {
                "title": "Junior Software Developer",
                "dates": "Oct 2020 - Current",
                "descriptions": [
                    "Worked on implementing Roll20's first Node.js/Express microservice via TypeScript/JavaScript and Mongo/Mongoose. Included a flexible GraphQLAPI, Atlas search integration, authorization with OAuth/OpenID via our Hydra auth server, and data importing from a legacy Postgres database.",
                    "Converted legacy permissions from scattered, disparate permissions across multiple Postgres tables into one polymorphic Postgres table for easier access, better testability in RSpec, and to offer a single source of truth.",
                    "Integrated new Cypress end to end test suites across a variety of Roll20 features. Updated the primary codebase Rpsec testing setup for organization and efficiency.",
                    "Developed the first iteration of the Dungeons and Dragons mobile character sheet for the Roll20 mobile app beta.",
                    "Converted key Roll20 compendium pages from legacy Erb/Haml code to modern Javascript via Vue, Vuex, and Vue Router.",
                    "Stepped in as a temporary Product Owner and assisted with roadmap development, critical project execution, and daily team management.",
                    "Worked alongside various cross-functional teams to develop any other features, functions, and bug fixes needed for the Roll20 platform, both inside and outside the Virtual Tabletop",
                    "Assisted various non-technical teams and team members in project ideation, bug reporting, and general support."
                ]
            },
            {
                "title": "Customer Support Team Lead",
                "dates": "Aug 2020 - Oct 2020",
                "descriptions": [
                    "Lead a team of several customer representatives in managing Roll20's various support channels.",
                    "Reviewed various customer service analytics (CSAT, SLA, LT) and SOO's and guided team in advancing associated goals.",
                    "Proposed and managed several vertical and horizontal projects and initiatives including but not limited to Roll20 Help Center improvements and bug troubleshooting process updates."
                ]
            },
            {
                "title": "Customer Agent",
                "dates": "May 2019 - Aug 2020",
                "descriptions": [
                    "Provided customer service and troubleshooting through a variety of mediums including Jira Service Desk, Roll20 Forums, Twitter, Facebook, and Reddit.",
                    "Investigated, identified, and reported bugs and errors from Roll20 user base and other end points.",
                    "Assisted in creating, managing, and maintaining public-facing Roll20 documentation. Supported and processed the transfer of Roll20 documentation from in-house Wiki to Confluence.",
                    "Provided support wherever and however needed to other internal teams."
                ]
            }
        ]
    },
    "cli": {
        "name": "CLI",
        "description": "A progressive full-service branding, software development and digital advertising agency.",
        "roles": [
            {
                "title": "Frontend Developer",
                "dates": "Mar 2016 - May 2019",
                "descriptions": [
                    "Added responsive styling utilizing CSS3 via a combination of Sass as a preprocessor and Grunt as a task runner.",
                    "Created UI/UX and frontend element interactions utilizing JavaScript and jQuery.",
                    "Collaborated with designers to create clean interfaces and simple, intuitive interactions and experiences.",
                    "Developed and implemented SEO strategies to increase brand recognition and website traffic."
                ]
            },
            {
                "title": "Project Manager",
                "dates": "Dec 2017 - Sep 2018",
                "descriptions": [
                    "Gathered client business requirements through interviews, document analysis, and workflow review, ensuring business needs were effectively identified, for 4 retainer clients as well as all newly on-boarded clients.",
                    "Translated and prioritized requirements into detailed but simple technical scope or business cases.",
                    "Generated test cases and ran test scenarios through manual testing while facilitating necessary changes in the project to meet client business requirements.",
                    "Managed communication between client, development team, and development support team."
                ]
            }
        ]
    },
    "uhaul": {
        "name": "U-Haul International, Inc.",
        "description": "A moving equipment and storage rental company.",
        "roles": [
            {
                "title": "Technical Writer",
                "dates": "Sep 2018 - Nov 2018",
                "descriptions": [
                    "Researched and documented business rules, user guides, testing scripts, field manuals, technical rules and requirements, development rules, release notes, and anything else associated with TW WR documentation.",
                    "Conducted business group and user analysis for technical and business documentation.",
                    "Managed document repository updates, revisions, and general maintenance through Confluence."
                ]
            }
        ]
    },
    "apple": {
        "name": "Apple",
        "description": "A technology company that specializes in consumer electronics, software and online services",
        "roles": [
            {
                "title": "Customer Representative, College Program",
                "dates": "Sep 2015 - Mar 2016",
                "descriptions": [
                    "Provided exceptional customer service while solving customer issues in a timely manner.",
                    "Maintained high customer satisfaction records of 95% while seeking new ways to improve overall service.",
                    "Supported wireless carrier reps in activating new accounts and correcting service on existing products.",
                    "Transferred customers to the appropriate department or wireless carrier when necessary to ensure timely resolution.",
                    "Offered support options to ineligible customers to increase customer satisfaction."
                ]
            }
        ]
    },
    "mjs": {
        "name": "MJS Designs, Inc.",
        "description": "A leading electronics manufacturing services provider specializing in Printed Circuit Boards (PCBs).",
        "roles": [
            {
                "title": "Automated Optical Inspection (AOI) Programmer",
                "dates": "Aug 2014 - Aug 2015",
                "descriptions": [
                    "Designed and developed AOI/surface mount technology (SMT) programs and supported AOI/SMT operations.",
                    "Prepared and created computer-aided design utility files, and implemented maintenance, troubleshooting, and resolution of AOI systems.",
                    "Performed mechanical, functional inspection, and testing tasks with strict attention to detail.",
                    "Conducted weekly training sessions for AOI systems operation, and formulated operating instructions and inspection checkpoints.",
                    "Developed and executed functional test activities and test processes, and resolved testing problems, including system malfunctions and data interpretation."
                ]
            }
        ]
    }
}